## Plan Result (stg_frontdoor - TerraformPlanApply)




<pre><code>Plan: 60 to add, 32 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;opal-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;opal-frontend-test&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;toffee-frontend-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;opal-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;opal-frontend-test&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;toffee-frontend-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-video-web&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;opal-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;opal-frontend-test&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee-frontend-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["staging-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      ~ host_name                      = "dualstack.iacfees-s-elbhmcts-dgd2ej56uxef-715536071.eu-west-1.elb.amazonaws.com" -> "dualstack.iacfees-s-ELBhmcts-DGD2EJ56UXEF-715536071.eu-west-1.elb.amazonaws.com"
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/originGroups/staging-immigrationappealsonline/origins/staging-immigrationappealsonline"
        name                           = "staging-immigrationappealsonline"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["c100-application"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/c100applicationcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/c100-application"
        name                            = "c100-application"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/darts-portal"
        name                            = "darts-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-bureau"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/juror-bureau"
        name                            = "juror-bureau"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/juror-public"
        name                            = "juror-public"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["opal-frontend"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/opal-frontend"
        name                            = "opal-frontend"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["opal-frontend-test"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/opal-frontend-test"
        name                            = "opal-frontend-test"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pip-frontend"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/pipfrontendcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/pip-frontend"
        name                            = "pip-frontend"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pip-frontend-b2c-sign-in"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/pip-frontend-b2c-sign-in"
        name                            = "pip-frontend-b2c-sign-in"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pip-frontend-b2c-staff"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/pip-frontend-b2c-staff"
        name                            = "pip-frontend-b2c-staff"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["portal-stg"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/portal-stg"
        name                            = "portal-stg"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pre-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/pre-portal"
        name                            = "pre-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/sds-api-mgmt"
        name                            = "sds-api-mgmt"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-casetracker"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingcasetrackercaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-casetracker"
        name                            = "staging-casetracker"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-certificatedbailiffs"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingcertificatedbailiffscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-certificatedbailiffs"
        name                            = "staging-certificatedbailiffs"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-courtfines"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingcourtfinescaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-courtfines"
        name                            = "staging-courtfines"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingimmigrationappealsonlinecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-immigrationappealsonline"
        name                            = "staging-immigrationappealsonline"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-admin-appeals"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribadminappealscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-admin-appeals"
        name                            = "staging-trib-admin-appeals"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-care-standards"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribcarestandardscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-care-standards"
        name                            = "staging-trib-care-standards"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-cicap"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribcicapcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-cicap"
        name                            = "staging-trib-cicap"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-employment-appeals"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribemploymentappealscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-employment-appeals"
        name                            = "staging-trib-employment-appeals"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-finance-tax"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribfinancetaxcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-finance-tax"
        name                            = "staging-trib-finance-tax"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-immigration-svcs"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribimmigrationsvcscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-immigration-svcs"
        name                            = "staging-trib-immigration-svcs"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-info-rights"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribinforightscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-info-rights"
        name                            = "staging-trib-info-rights"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-land-reg-division"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtriblandregdivisioncaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-land-reg-division"
        name                            = "staging-trib-land-reg-division"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-lands-chamber"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtriblandschambercaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-lands-chamber"
        name                            = "staging-trib-lands-chamber"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["staging-trib-tansport-appeals"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/stagingtribtansportappealscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/staging-trib-tansport-appeals"
        name                            = "staging-trib-tansport-appeals"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["toffee"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/toffeecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/toffee"
        name                            = "toffee"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["toffee-frontend-staging"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/toffeefrontendstagingcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/toffee-frontend-staging"
        name                            = "toffee-frontend-staging"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/vh-admin-web"
        name                            = "vh-admin-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/vh-video-web"
        name                            = "vh-video-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "c100applicationHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dartsportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jurorbureauHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jurorpublicHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["opal-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "opalfrontendHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["opal-frontend-test"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "opalfrontendtestHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "pipfrontendHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pip-frontend-b2c-sign-in"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "pipfrontendb2csigninHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pip-frontend-b2c-staff"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "pipfrontendb2cstaffHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["portal-stg"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "portalstgHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "preportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sdsapimgmtHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-casetracker"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingcasetrackerHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-certificatedbailiffs"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingcertificatedbailiffsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-courtfines"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingcourtfinesHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-immigrationappealsonline"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingimmigrationappealsonlineHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-admin-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribadminappealsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-care-standards"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribcarestandardsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-cicap"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribcicapHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-employment-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribemploymentappealsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-finance-tax"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribfinancetaxHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-immigration-svcs"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribimmigrationsvcsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-info-rights"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribinforightsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-land-reg-division"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtriblandregdivisionHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-lands-chamber"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtriblandschamberHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["staging-trib-tansport-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "stagingtribtansportappealsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "toffeeHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["toffee-frontend-staging"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "toffeefrontendstagingHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhadminwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhvideowebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "c100applicationHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "dartsportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "jurorbureauHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "jurorpublicHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["opal-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "opalfrontendHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["opal-frontend-test"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "opalfrontendtestHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "pipfrontendHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pip-frontend-b2c-sign-in"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "pipfrontendb2csigninHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pip-frontend-b2c-staff"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "pipfrontendb2cstaffHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["portal-stg"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "portalstgHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "preportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "sdsapimgmtHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-casetracker"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingcasetrackerHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-certificatedbailiffs"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingcertificatedbailiffsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-courtfines"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingcourtfinesHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-immigrationappealsonline"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingimmigrationappealsonlineHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-admin-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribadminappealsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-care-standards"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribcarestandardsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-cicap"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribcicapHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-employment-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribemploymentappealsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-finance-tax"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribfinancetaxHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-immigration-svcs"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribimmigrationsvcsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-info-rights"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribinforightsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-land-reg-division"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtriblandregdivisionHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-lands-chamber"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtriblandschamberHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["staging-trib-tansport-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "stagingtribtansportappealsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "toffeeHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["toffee-frontend-staging"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "toffeefrontendstagingHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "vhadminwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "vhvideowebHstsRule"
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 60 to add, 32 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":918,"Program":"tfcmt","SHA1":"","Target":"stg_frontdoor - TerraformPlanApply","Vars":{}} -->